---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MassDataSkylightWidth
source: html/f63499d4-f977-8393-54c5-7aba3a29f0e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MassDataSkylightWidth Property

"Skylight Width & Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId MassDataSkylightWidth { get; }
```